Show / Hide Table of Contents
Class CrossSection
Cross-section
Inheritance
System.Object
OpenObject
OpenElementId
CrossSection
CrossSectionComponent
CrossSectionGeneralColdFormed
CrossSectionParameter
Inherited Members
 OpenElementId.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.CrossSection
Assembly: IdeaRS.OpenModel.dll
Syntax
public abstract class CrossSection : OpenElementId
Constructors
Improve this Doc   View Source
CrossSection()
Constructor
Declaration
public CrossSection()
Properties
Improve this Doc   View Source
CrossSectionRotation
Rotation of Cross - Section
Declaration
public double CrossSectionRotation { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Name
Name of cross-section
Declaration
public string Name { get; set; }
Property Value
 Type |  Description
 System.String
 Improve this Doc
 View Source